app/Models/ModelUser.php

    public function LoginUser($email,$password)
    {
        return $this->db->table('tbl_user')
        ->where([
            'email' => $email,
            'password' => $password,
        ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'admin1@gmail.com'
AND `password` = 'd5f12e53a182c062b6bf30c1445153faff12269a'