app/Models/ModelRinci.php

SELECT *
FROM `tbl_barang_keluar`
JOIN `tbl_barang` ON `tbl_barang`.`kode_barang`=`tbl_barang_keluar`.`kode_barang`
ORDER BY `id_barang_keluar` DESC
---
    public function alldata()
    {
        return $this->db->table('tbl_barang_keluar')
        ->join('tbl_barang','tbl_barang.kode_barang=tbl_barang_keluar.kode_barang')
        ->orderBy('id_barang_keluar','DESC')
        ->get()->getresultArray();