app/Models/ModelBarang.php

    public function AllData()
    {
        return $this->db->table('tbl_barang')
        ->join('tbl_kategori','tbl_kategori.id_kategori=tbl_barang.id_kategori')
        ->join('tbl_satuan','tbl_satuan.id_satuan=tbl_barang.id_satuan')
        ->orderBy('id_barang','DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_barang`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_barang`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_barang`.`id_satuan`
ORDER BY `id_barang` DESC