app/Models/ModelAdmin.php

    public function DetailData()
    {
        return $this->db->table('tbl_setting')->where('id','1')->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = '1'

    public function JumlahBarang()
    {
        return $this->db->table('tbl_barang')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_barang`

    public function JumlahKategori()
    {
        return $this->db->table('tbl_kategori')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_kategori`

    public function JumlahSatuan()
    {
        return $this->db->table('tbl_satuan')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_satuan`

    public function JumlahUser()
    {
        return $this->db->table('tbl_user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_user`