app/Models/ModelPeminjam.php

    public function CekBarang($kode_barang)
    {
        return $this->db->table('tbl_barang')
        ->join('tbl_kategori','tbl_kategori.id_kategori=tbl_barang.id_kategori')
        ->join('tbl_satuan','tbl_satuan.id_satuan=tbl_barang.id_satuan')
        ->where('kode_barang', $kode_barang)
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_barang`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_barang`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_barang`.`id_satuan`
WHERE `kode_barang` = '88888'

    public function AllBarang()
    {
        return $this->db->table('tbl_barang')
        ->join('tbl_kategori','tbl_kategori.id_kategori=tbl_barang.id_kategori')
        ->join('tbl_satuan','tbl_satuan.id_satuan=tbl_barang.id_satuan')
        ->where('stok > 0')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_barang`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_barang`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_barang`.`id_satuan`
WHERE `stok` >0